[
    {
        "monster_name": "Goblin",
        "initial_description": "A small, green creature with a mischievous grin appears. It looks like it hasn't had breakfast yet, and you might be on the menu.",
        "hit_dice": 2,
        "attack_die": 6,
        "defense": 1
    },
    {
        "monster_name": "Luggage",
        "initial_description": "A walking chest with hundreds of little legs trots up to you. Its lid opens slightly, revealing rows of sharp teeth. Friendly? Maybe not.",
        "hit_dice": 4,
        "attack_die": 8,
        "defense": 3
    },
    {
        "monster_name": "Swamp Dragon",
        "initial_description": "A dragon the size of a small dog hiccups, emitting a small flame. It looks at you apologetically before preparing to sneeze again.",
        "hit_dice": 3,
        "attack_die": 6,
        "defense": 2
    },
    {
        "monster_name": "Troll",
        "initial_description": "A large, rocky creature lumbers into view. It seems to be pondering the meaning of life, or possibly just what to have for dinner.",
        "hit_dice": 8,
        "attack_die": 10,
        "defense": 4
    },
    {
        "monster_name": "Werewolf",
        "initial_description": "A hairy individual howls at the moon, then checks his watch. 'Is it that time of the month already?' he mutters.",
        "hit_dice": 6,
        "attack_die": 10,
        "defense": 3
    },
    {
        "monster_name": "Vampire",
        "initial_description": "A pale figure in a cape appears, dramatically backlit. He pauses, waiting for applause that never comes.",
        "hit_dice": 7,
        "attack_die": 12,
        "defense": 3
    },
    {
        "monster_name": "Gelatinous Cube",
        "initial_description": "A large, wobbly cube of jelly approaches. It jiggles menacingly, if such a thing is possible.",
        "hit_dice": 4,
        "attack_die": 8,
        "defense": 2
    },
    {
        "monster_name": "Mimic",
        "initial_description": "You see a perfectly ordinary chest. It winks at you. Wait, chests don't have eyes...",
        "hit_dice": 5,
        "attack_die": 8,
        "defense": 3
    },
    {
        "monster_name": "Beholder",
        "initial_description": "A floating orb with multiple eyestalks drifts into view. It looks like it's having a bad hair day, if eyes could have hair.",
        "hit_dice": 10,
        "attack_die": 20,
        "defense": 5
    },
    {
        "monster_name": "Rust Monster",
        "initial_description": "A peculiar creature scuttles towards you, its antennae twitching excitedly at the sight of your shiny armor.",
        "hit_dice": 3,
        "attack_die": 6,
        "defense": 2
    },
    {
        "monster_name": "Kobold",
        "initial_description": "A tiny, scaly humanoid appears, brandishing a spoon like it's the mightiest of weapons. It's adorably fierce.",
        "hit_dice": 1,
        "attack_die": 4,
        "defense": 1
    },
    {
        "monster_name": "Animated Broom",
        "initial_description": "A broom stands upright, bristles twitching. It eyes the dirt on your boots disapprovingly.",
        "hit_dice": 1,
        "attack_die": 4,
        "defense": 1
    },
    {
        "monster_name": "Awakened Shrub",
        "initial_description": "A small bush waddles towards you. It looks like it's trying to decide whether to offer you a flower or slap you with a branch.",
        "hit_dice": 1,
        "attack_die": 4,
        "defense": 1
    },
    {
        "monster_name": "Flumph",
        "initial_description": "A jellyfish-like creature floats by, telepathically humming an off-key tune. It seems more interested in making friends than fighting.",
        "hit_dice": 2,
        "attack_die": 6,
        "defense": 1
    },
    {
        "monster_name": "Flying Sword",
        "initial_description": "A sword hovers in the air, point aimed at you. It looks like it's trying to remember which end is the handle.",
        "hit_dice": 2,
        "attack_die": 6,
        "defense": 2
    },
    {
        "monster_name": "Crawling Claw",
        "initial_description": "A disembodied hand scuttles across the floor. It's making frantic gestures that could either mean 'hello' or 'prepare to die'.",
        "hit_dice": 1,
        "attack_die": 4,
        "defense": 1
    },
    {
        "monster_name": "Pixie",
        "initial_description": "A tiny winged humanoid zips around your head, giggling mischievously. It seems to be playing a one-sided game of tag.",
        "hit_dice": 1,
        "attack_die": 4,
        "defense": 1
    },
    {
        "monster_name": "Pseudodragon",
        "initial_description": "A cat-sized dragon lands on a nearby rock, trying to look fierce. It manages to be more cute than intimidating.",
        "hit_dice": 2,
        "attack_die": 4,
        "defense": 2
    },
    {
        "monster_name": "Skeleton",
        "initial_description": "A skeleton walks in, its bones rattling like percussion instruments. It looks like it's one femur away from falling apart.",
        "hit_dice": 2,
        "attack_die": 6,
        "defense": 1
    },
    {
        "monster_name": "Stirge",
        "initial_description": "A bizarre mix of bat and mosquito buzzes towards you. It's eyeing your neck like it's an all-you-can-drink buffet.",
        "hit_dice": 1,
        "attack_die": 4,
        "defense": 1
    },
     {
        "monster_name": "Living Topiary",
        "initial_description": "A carefully manicured bush shaped like a unicorn gallops towards you. Its leafy mane flows in the wind, and its hedge-clipped hooves make surprisingly intimidating thuds.",
        "hit_dice": 4,
        "attack_die": 8,
        "defense": 2
    },
    {
        "monster_name": "Ink Elemental",
        "initial_description": "A swirling mass of living ink rises from a fallen quill. It seems to be writing threatening messages in mid-air, though its spelling could use some work.",
        "hit_dice": 5,
        "attack_die": 8,
        "defense": 2
    },
    {
        "monster_name": "Clockwork Knight",
        "initial_description": "A mechanical warrior approaches, each step precisely measured. It stops briefly to oil its joints before raising its sword with mathematical precision.",
        "hit_dice": 6,
        "attack_die": 10,
        "defense": 4
    },
    {
        "monster_name": "Cheese Golem",
        "initial_description": "A hulking figure made entirely of various aged cheeses lumbers forward. The smell alone could be considered a weapon.",
        "hit_dice": 5,
        "attack_die": 8,
        "defense": 3
    },
    {
        "monster_name": "Origami Dragon",
        "initial_description": "A paper dragon unfolds itself from a nearby scroll. It looks delicate but those edges seem surprisingly sharp.",
        "hit_dice": 3,
        "attack_die": 6,
        "defense": 2
    },
    {
        "monster_name": "Bookwyrm",
        "initial_description": "A serpentine creature made of bound books and loose pages slithers forth, apparently very angry about overdue library fees.",
        "hit_dice": 4,
        "attack_die": 8,
        "defense": 2
    },
    {
        "monster_name": "Crystaline Warrior",
        "initial_description": "A humanoid figure of pure crystal steps forward, refracting light in dazzling patterns. It raises a translucent blade that chimes melodiously.",
        "hit_dice": 6,
        "attack_die": 10,
        "defense": 3
    },
    {
        "monster_name": "Possessed Painting",
        "initial_description": "A portrait steps out of its frame, its subject now three-dimensional but still somewhat flat. It poses dramatically, waiting for the perfect angle to attack.",
        "hit_dice": 3,
        "attack_die": 6,
        "defense": 2
    },
    {
        "monster_name": "Soup Spirit",
        "initial_description": "A steaming apparition rises from a abandoned bowl of soup, wielding a spectral ladle. The phrase 'you are what you eat' comes to mind.",
        "hit_dice": 4,
        "attack_die": 6,
        "defense": 2
    },
    {
        "monster_name": "Marble Sphinx",
        "initial_description": "A sphinx carved from marble springs to life, its stone wings creating a shower of dust. It opens its mouth to ask a riddle, but just meows instead.",
        "hit_dice": 5,
        "attack_die": 8,
        "defense": 4
    },
    {
        "monster_name": "Living Constellation",
        "initial_description": "A cluster of stars descends from above, forming the shape of a warrior. It brandishes a sword made of starlight, though it keeps losing its shape as the stars drift slightly.",
        "hit_dice": 6,
        "attack_die": 10,
        "defense": 3
    },
    {
        "monster_name": "Yarn Elemental",
        "initial_description": "A swirling vortex of yarn approaches, knitting needles orbiting it menacingly. Several half-finished scarves trail behind it like tentacles.",
        "hit_dice": 3,
        "attack_die": 6,
        "defense": 2
    },
    {
        "monster_name": "Mosaic Guardian",
        "initial_description": "A figure assembled from countless tiny tiles shifts into view. Pieces occasionally fall off only to float back into place, making a sound like angry wind chimes.",
        "hit_dice": 5,
        "attack_die": 8,
        "defense": 3
    },
    {
        "monster_name": "Fungal Knight",
        "initial_description": "A humanoid figure composed entirely of various mushrooms emerges from the shadows. Its armor appears to be made of shelf fungi, and spores puff out with each step.",
        "hit_dice": 4,
        "attack_die": 8,
        "defense": 3
    },
    {
        "monster_name": "Prism Beast",
        "initial_description": "A creature made of pure light refracts through a crystal, splitting into a rainbow of colored copies. Each one seems to think it's the original.",
        "hit_dice": 5,
        "attack_die": 8,
        "defense": 2
    },
    {
        "monster_name": "Clockwork Phoenix",
        "initial_description": "A mechanical bird wreathed in steam and magical flames soars overhead. Its gears grind in a way that somehow sounds like a battle cry.",
        "hit_dice": 6,
        "attack_die": 10,
        "defense": 3
    },
    {
        "monster_name": "Echo Knight",
        "initial_description": "A warrior made of pure sound waves materializes, each movement creating ripples in the air. Its battle cry is literally its entire being.",
        "hit_dice": 4,
        "attack_die": 8,
        "defense": 2
    },
    {
        "monster_name": "Textile Titan",
        "initial_description": "A giant humanoid woven from various fabrics towers above you. It brandishes a needle like a sword, trailing a thread that seems sharp enough to cut.",
        "hit_dice": 6,
        "attack_die": 10,
        "defense": 3
    },
    {
        "monster_name": "Puzzle Golem",
        "initial_description": "A construct made of interlocking puzzle pieces shuffles forward. Parts of it occasionally fall off and reassemble in different configurations.",
        "hit_dice": 5,
        "attack_die": 8,
        "defense": 3
    },
    {
        "monster_name": "Living Sundial",
        "initial_description": "A creature of shadow and brass rotates menacingly. Its gnomon points at you like an accusing finger as it prepares to tell you your time is up.",
        "hit_dice": 3,
        "attack_die": 6,
        "defense": 2
    }
]
